04_OpenFoam/_Tut_02/OpenFOAM-14/fluid/concentricCylinders/constant/radiationProperties.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiationModel  fvDOM;

fvDOM
{
    nPhi        40;     // azimuthal angles in PI/2 on X-Y.(from Y to X)
    nTheta      1;      // polar angles in PI (from Z to X-Y plane)
    tolerance   1e-3;   // convergence tolerance for radiation iteration
    maxIter     10;     // maximum number of iterations
}

solverFreq 1;

absorptionEmissionModel constant;

constant
{
    absorptivity    1e-8;
    emissivity      0;
    E               0;
}

scatterModel    none;

sootModel       none;

// ************************************************************************* //
